{
  "django": {
    "title": "Against: Django",
    "subtitle": "Expose the hidden costs and limitations of using a heavy backend framework for internal tools.",
    "tabs": [
      {
        "id": "key-differentiators",
        "title": "Key Differentiators",
        "description": null,
        "headers": ["Key Pointer", "Their Approach (Pain Point)", "Our Platform (Solution)"],
        "content": [
          {
            "row": ["UI", "Rigid, outdated admin UI. Customization is heavy developer work.", "Modern drag-and-drop UI builder. Build polished interfaces in minutes."],
            "details": [
              "The default Django admin is functional but not user-friendly for business teams.",
              "Achieving a modern look and feel requires overriding templates and writing significant CSS, which ties up expensive developer resources."
            ]
          },
          {
            "row": ["Data Connectors", "Tied to a **single database**. Connecting to other sources requires custom code.", "**Dozens of pre-built connectors.** Connect to any data source in minutes, no code needed."],
            "details": [
              "Django's ORM is designed to work with one primary SQL database.",
              "To pull data from Salesforce, Stripe, or even a Google Sheet, a developer must write a custom integration, handle authentication, and manage API clients."
            ]
          }
        ]
      }
    ]
  },
  "retool": {
    "title": "Against: Retool",
    "subtitle": "Position DronaHQ as the more accessible, scalable, and commercially friendly platform.",
    "tabs": [
      {
        "id": "tech-diff",
        "title": "Technical Differentiators",
        "description": null,
        "headers": ["Feature", "DronaHQ", "Retool"],
        "content": [
          {
            "row": ["Logic Building", "Visual, block-based \"Action Flow\" builder, promoting a no-code/low-code approach.", "Code-centric, primarily relying on JavaScript in event handlers and transformers."],
            "details": [
              "DronaHQ's visual action flows allow business users and junior developers to build complex logic without writing code.",
              "Retool requires proficiency in JavaScript for most non-trivial actions, creating a higher barrier to entry."
            ]
          }
        ]
      }
    ]
  }
}
